; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v4)
             (pred_3 ?v5 ?v11)
             (pred_6 ?v6 ?v11)
             (pred_12 ?v9 ?v6 )
	     (pred_2 ?v6)
             (pred_7 ?v7)
             (pred_10 ?v5)
             (pred_4 ?v11)
             (pred_11 ?v6)
             (pred_1 ?v5)
             (pred_9 ?v6)
             (pred_5 ))



(:action op_5
:parameters (?v3 ?v13 ?v8 ?v1)
:precondition (and (pred_7 ?v3) (pred_7 ?v13) (pred_10 ?v8) (pred_4 ?v1)
          (pred_8 ?v3 ?v13) (pred_3 ?v8 ?v1)
                   (pred_6 ?v13 ?v1) (pred_2 ?v3) 
                   (pred_11 ?v13) (pred_1 ?v8))
:effect (and  (pred_9 ?v13) (not (pred_11 ?v13))))


(:action op_1
:parameters (?v3 ?v12)
:precondition (and (pred_7 ?v3) (pred_7 ?v12)
               (pred_2 ?v3) (pred_8 ?v3 ?v12) (pred_9 ?v12))
:effect (and (pred_2 ?v12) (not (pred_2 ?v3))))

(:action op_3
:parameters (?v3 ?v8)
:precondition (and (pred_7 ?v3) (pred_10 ?v8) 
                  (pred_2 ?v3) (pred_12 ?v8 ?v3) (pred_5 ))
:effect (and (pred_1 ?v8)
   (not (pred_12 ?v8 ?v3)) (not (pred_5 ))))


(:action op_4
:parameters (?v3 ?v10 ?v2)
:precondition (and (pred_7 ?v3) (pred_10 ?v10) (pred_10 ?v2)
                  (pred_2 ?v3) (pred_1 ?v2) (pred_12 ?v10 ?v3))
:effect (and (pred_1 ?v10) (pred_12 ?v2 ?v3)
        (not (pred_1 ?v2)) (not (pred_12 ?v10 ?v3))))

(:action op_2
:parameters (?v3 ?v8)
:precondition (and (pred_7 ?v3) (pred_10 ?v8) 
                  (pred_2 ?v3) (pred_1 ?v8))
:effect (and (pred_5 ) (pred_12 ?v8 ?v3) (not (pred_1 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_02 obj_17 obj_30 obj_09 obj_07 obj_22 obj_24 obj_08 obj_01 obj_15 obj_13 obj_14 obj_29 obj_05 obj_10 obj_28 obj_27 obj_20 obj_04 obj_11 obj_12 obj_25 obj_21 obj_18
    obj_19 obj_03
    obj_16 obj_23 obj_26
    )

    (:init
       (pred_5)

       (pred_7 obj_06)
       (pred_7 obj_02)
       (pred_7 obj_17)
       (pred_7 obj_30)
       (pred_7 obj_09)
       (pred_7 obj_07)
       (pred_7 obj_22)
       (pred_7 obj_24)
       (pred_7 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_29)
       (pred_7 obj_05)
       (pred_7 obj_10)
       (pred_7 obj_28)
       (pred_7 obj_27)
       (pred_7 obj_20)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_12)
       (pred_7 obj_25)
       (pred_7 obj_21)
       (pred_7 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_03)
       (pred_10 obj_16)
       (pred_10 obj_23)
       (pred_10 obj_26)

       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_17 obj_24)
       (pred_8 obj_17 obj_30)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_30 obj_08)
       (pred_8 obj_30 obj_09)
       (pred_8 obj_30 obj_17)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_30)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_22 obj_24)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_24 obj_14)
       (pred_8 obj_24 obj_08)
       (pred_8 obj_24 obj_17)
       (pred_8 obj_24 obj_22)
       (pred_8 obj_08 obj_29)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_08 obj_30)
       (pred_8 obj_08 obj_24)
       (pred_8 obj_01 obj_05)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_15 obj_10)
       (pred_8 obj_15 obj_13)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_13 obj_28)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_13 obj_15)
       (pred_8 obj_14 obj_27)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_14 obj_24)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_29 obj_20)
       (pred_8 obj_29 obj_05)
       (pred_8 obj_29 obj_08)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_05 obj_04)
       (pred_8 obj_05 obj_01)
       (pred_8 obj_05 obj_29)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_10 obj_28)
       (pred_8 obj_10 obj_15)
       (pred_8 obj_28 obj_12)
       (pred_8 obj_28 obj_27)
       (pred_8 obj_28 obj_13)
       (pred_8 obj_28 obj_10)
       (pred_8 obj_27 obj_25)
       (pred_8 obj_27 obj_20)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_27 obj_28)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_04)
       (pred_8 obj_20 obj_29)
       (pred_8 obj_20 obj_27)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_05)
       (pred_8 obj_04 obj_20)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_12 obj_28)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_25 obj_27)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_21)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_13)
       (pred_6  obj_10 obj_19)
       (pred_6  obj_21 obj_03)
       (pred_6  obj_13 obj_19)
       (pred_9 obj_06)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_30)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_22)
       (pred_9 obj_24)
       (pred_9 obj_08)
       (pred_9 obj_01)
       (pred_9 obj_15)
       (pred_9 obj_14)
       (pred_9 obj_29)
       (pred_9 obj_05)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_11)
       (pred_9 obj_12)
       (pred_9 obj_25)
       (pred_9 obj_18)

       (pred_3  obj_16 obj_19)
       (pred_3  obj_23 obj_03)
       (pred_3  obj_26 obj_19)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_23 obj_15)
       (pred_12 obj_26 obj_22)
       (pred_2 obj_12)
    )

    (:goal (and
       (pred_12 obj_16 obj_22)
    ))
(:constraints
  (always (not (pred_2 obj_28)))
)
)

; plan
1. (op_1 obj_12 obj_25)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_25)
   goals met: 0 of 1
2. (op_1 obj_25 obj_27)
   deleted: (pred_2 obj_25)
   added: (pred_2 obj_27)
   goals met: 0 of 1
3. (op_1 obj_27 obj_14)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_14)
   goals met: 0 of 1
4. (op_1 obj_14 obj_24)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_24)
   goals met: 0 of 1
5. (op_1 obj_24 obj_22)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_22)
   goals met: 0 of 1
6. (op_1 obj_22 obj_02)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_02)
   goals met: 0 of 1
7. (op_3 obj_02 obj_16)
   deleted: (pred_12 obj_16 obj_02) (pred_5)
   added: (pred_1 obj_16)
   goals met: 0 of 1
8. (op_1 obj_02 obj_22)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_22)
   goals met: 0 of 1
9. (op_4 obj_22 obj_26 obj_16)
   deleted: (pred_1 obj_16) (pred_12 obj_26 obj_22)
   added: (pred_1 obj_26) (pred_12 obj_16 obj_22)
   goals met: 1 of 1
